000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/РабочийГрафик/РабочийГрафик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РабочийГрафик</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетРабочегоВремениПлан/УчетРабочегоВремениПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремениПлан</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВремени</name>
    <type>
      <types>EnumRef.ТипВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетРабочегоВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасовПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасовФактАвто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасовФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетРабочегоВремениФакт/УчетРабочегоВремениФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремениФакт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ЗаписаноЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВремени</name>
    <type>
      <types>EnumRef.ТипВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипВремени/ТипВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипВремени</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Уход</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/УчетРабочегоВремениРасширенный/Module.bsl
Функция БуквенныйКодИмяРеквизита(Месяц) Экспорт 
	
	Возврат  "БуквенныйКод";
	
КонецФункции

Процедура ЗарегистрироватьДанныеИндивидуальногоГрафика(Движения, ДанныеОВремени, ПериодРегистрации = '00010101') Экспорт
	Для Каждого СтрокаДанных Из ДанныеОВремени Цикл
		Запись = Движения.РабочийГрафик.Добавить();
		
		Запись.Период = СтрокаДанных.Дата;
		Запись.Сотрудник = СтрокаДанных.Сотрудник;
		Запись.Организация = СтрокаДанных.Организация;
		Запись.Магазин = СтрокаДанных.Магазин;
		Запись.ПериодРегистрации = ?(ПериодРегистрации = '00010101', НачалоМесяца(Запись.Период), ПериодРегистрации);
		Запись.Часы = СтрокаДанных.Часов;
	КонецЦикла;	
	
	Движения.РабочийГрафик.Записывать = Истина;
КонецПроцедуры

Процедура ЗарегистрироватьДанныеУчетРабочегоВремениПлан(Движения, ДанныеОВремени, ПериодРегистрации = '00010101') Экспорт
	Для Каждого СтрокаДанных Из ДанныеОВремени Цикл
		Запись = Движения.УчетРабочегоВремениПлан.Добавить();
		
		Запись.Период = СтрокаДанных.Период;
		Запись.Сотрудник = СтрокаДанных.Сотрудник;
		Запись.Организация = СтрокаДанных.Организация;
		Запись.Магазин = СтрокаДанных.Магазин;
		Запись.ТипВремени = СтрокаДанных.ТипВремени;
	КонецЦикла;	
	
	Движения.УчетРабочегоВремениПлан.Записывать = Истина;
КонецПроцедуры

Процедура ЗарегистрироватьДанныеТабеля(Движения, ДанныеОВремени) Экспорт
	Для Каждого СтрокаДанных Из ДанныеОВремени Цикл
		Запись = Движения.УчетРабочегоВремени.Добавить();
		
		Запись.Период = СтрокаДанных.Дата;
		Запись.Сотрудник = СтрокаДанных.Сотрудник;
		Запись.Организация = СтрокаДанных.Организация;
		Запись.Магазин = СтрокаДанных.Магазин;
		Запись.ПериодРегистрации = СтрокаДанных.ПериодРегистрации;
		Запись.КоличествоЧасовПлан = СтрокаДанных.КоличествоЧасовПлан;
		Запись.КоличествоЧасовФактАвто = СтрокаДанных.КоличествоЧасовФактАвто;
		Запись.КоличествоЧасовФакт = СтрокаДанных.КоличествоЧасовФакт;
		Запись.Комментарий = СтрокаДанных.Комментарий;
	КонецЦикла;	
	
	Движения.УчетРабочегоВремени.Записывать = Истина;
КонецПроцедуры


Процедура УчетРабочегоВремени() Экспорт
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	УчетРабочегоВремениФакт.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.УчетРабочегоВремениФакт КАК УчетРабочегоВремениФакт
		|ГДЕ
		|	УчетРабочегоВремениФакт.Период МЕЖДУ &ПериодС И &ПериодПо
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетРабочегоВремениФакт.Сотрудник";
	
	Запрос2.УстановитьПараметр("ПериодПо", КонецДня(ТекущаяДата()));
	Запрос2.УстановитьПараметр("ПериодС", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса2 = Запрос2.Выполнить();
	
	ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	УчетРабочегоВремениФакт.ТипВремени КАК ТипВремени,
			|	УчетРабочегоВремениФакт.Период КАК Период,
			|	УчетРабочегоВремениФакт.Магазин КАК Магазин,
			|	УчетРабочегоВремениФакт.Организация КАК Организация
			|ИЗ
			|	РегистрСведений.УчетРабочегоВремениФакт КАК УчетРабочегоВремениФакт
			|ГДЕ
			|	УчетРабочегоВремениФакт.Сотрудник = &Сотрудник
			|	И УчетРабочегоВремениФакт.Период МЕЖДУ &ПериодС И &ПериодПо
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("ПериодПо", КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ПериодС", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи2.Сотрудник);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если  ВыборкаДетальныеЗаписи.ТипВремени = Перечисления.ТипВремени.Приход тогда
			текДАта =ТекущаяДата();	
			Магазин = ВыборкаДетальныеЗаписи.Магазин;
			Организация = ВыборкаДетальныеЗаписи.Организация;
			Сотрудник =ВыборкаДетальныеЗаписи2.Сотрудник;
			
			НаборЗаписей = РегистрыСведений.УчетРабочегоВремениФакт.СоздатьНаборЗаписей(); 

			НаборЗаписей.Отбор.Организация.Установить(Организация);
			НаборЗаписей.Отбор.Магазин.Установить(Магазин); 
			НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник); 
			НаборЗаписей.Отбор.период.Установить(текДАта); 

			НовЗапись = НаборЗаписей.Добавить();
			НовЗапись.Организация = Организация;
			НовЗапись.Магазин = Магазин;
			НовЗапись.Сотрудник = Сотрудник;
			НовЗапись.период = текДАта;
			НовЗапись.ТипВремени = Перечисления.ТипВремени.Уход;
			
			НовЗапись.ЗаписаноЗаданием = Истина;
			
			НаборЗаписей.Записать(Истина);
			КонецЕсли;
		КонецЦикла;                      
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
